Pandas -- Pandas is used for data manipulation analysis and cleaning

In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([1,2,3,4,5,6,7,8,9,10])

In [3]:
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [4]:
d=pd.date_range('20020301',periods=10)

In [5]:
print(d)

DatetimeIndex(['2002-03-01', '2002-03-02', '2002-03-03', '2002-03-04',
               '2002-03-05', '2002-03-06', '2002-03-07', '2002-03-08',
               '2002-03-09', '2002-03-10'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df=pd.DataFrame(np.random.randn(10,4),index=d,columns=['A','B','C','D'])

In [7]:
print(df)

                   A         B         C         D
2002-03-01  0.440661 -0.323184 -0.372120 -1.754519
2002-03-02  0.460905 -0.793540  0.076552  0.228480
2002-03-03  0.644773  1.488210  0.109205  0.324083
2002-03-04 -0.926943 -0.314424 -1.191608  0.737745
2002-03-05  0.731510 -1.437294 -1.028375  0.304454
2002-03-06 -1.702933 -1.097423  0.362248  0.615953
2002-03-07 -0.358349  0.796041 -0.308464 -0.431374
2002-03-08 -2.273382  0.734601 -0.507984 -1.332302
2002-03-09  0.068889 -0.642809 -1.871480 -0.191310
2002-03-10  0.253730  0.097930  2.355097 -1.083530

In [36]:
df1=pd.DataFrame({'A':[1,2,8,4,5],
                 'B':pd.Timestamp('20230301'),
                 'C':pd.Series(1,index=list(range(5))),
                 'D':np.array([5]*5, dtype='int32'),
                 'E':pd.Categorical(['true','False','True','False','True']),
                 'F':"Rajan"
                })

In [37]:
print(df1)

   A          B  C  D      E      F
0  1 2023-03-01  1  5   true  Rajan
1  2 2023-03-01  1  5  False  Rajan
2  8 2023-03-01  1  5   True  Rajan
3  4 2023-03-01  1  5  False  Rajan
4  5 2023-03-01  1  5   True  Rajan

In [10]:
df1.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.head() 
# head it will return the top 5 of data

                   A         B         C         D
2002-03-01  0.440661 -0.323184 -0.372120 -1.754519
2002-03-02  0.460905 -0.793540  0.076552  0.228480
2002-03-03  0.644773  1.488210  0.109205  0.324083
2002-03-04 -0.926943 -0.314424 -1.191608  0.737745
2002-03-05  0.731510 -1.437294 -1.028375  0.304454

In [12]:
df.tail()
# tail will return the bottom 5 of the data

                   A         B         C         D
2002-03-06 -1.702933 -1.097423  0.362248  0.615953
2002-03-07 -0.358349  0.796041 -0.308464 -0.431374
2002-03-08 -2.273382  0.734601 -0.507984 -1.332302
2002-03-09  0.068889 -0.642809 -1.871480 -0.191310
2002-03-10  0.253730  0.097930  2.355097 -1.083530

In [13]:
df.index
# it return the all index value from data

DatetimeIndex(['2002-03-01', '2002-03-02', '2002-03-03', '2002-03-04',
               '2002-03-05', '2002-03-06', '2002-03-07', '2002-03-08',
               '2002-03-09', '2002-03-10'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns
# columns  return the numbe of coloums

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df1.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [16]:
df.to_numpy()

array([[ 0.44066065, -0.32318446, -0.37212006, -1.75451924],
       [ 0.4609046 , -0.79354004,  0.07655219,  0.22847954],
       [ 0.64477325,  1.48821042,  0.10920491,  0.32408292],
       [-0.92694324, -0.31442449, -1.19160829,  0.7377452 ],
       [ 0.73150996, -1.43729392, -1.02837453,  0.30445367],
       [-1.70293287, -1.09742329,  0.3622484 ,  0.61595283],
       [-0.35834851,  0.7960408 , -0.30846397, -0.43137352],
       [-2.27338151,  0.7346012 , -0.50798421, -1.33230204],
       [ 0.06888944, -0.64280922, -1.87148043, -0.19130997],
       [ 0.25372971,  0.09792988,  2.35509719, -1.08353042]])

In [40]:
df.sort_index(axis=1,ascending=False)
# this sort by index one menas

                   D         C         B         A
2002-03-01 -1.754519 -0.372120 -0.323184  0.440661
2002-03-02  0.228480  0.076552 -0.793540  0.460905
2002-03-03  0.324083  0.109205  1.488210  0.644773
2002-03-04  0.737745 -1.191608 -0.314424 -0.926943
2002-03-05  0.304454 -1.028375 -1.437294  0.731510
2002-03-06  0.615953  0.362248 -1.097423 -1.702933
2002-03-07 -0.431374 -0.308464  0.796041 -0.358349
2002-03-08 -1.332302 -0.507984  0.734601 -2.273382
2002-03-09 -0.191310 -1.871480 -0.642809  0.068889
2002-03-10 -1.083530  2.355097  0.097930  0.253730

In [44]:
df.sort_values(by='C')
# this sort data table by c as we pass sort by c

                   A         B         C         D
2002-03-09  0.068889 -0.642809 -1.871480 -0.191310
2002-03-04 -0.926943 -0.314424 -1.191608  0.737745
2002-03-05  0.731510 -1.437294 -1.028375  0.304454
2002-03-08 -2.273382  0.734601 -0.507984 -1.332302
2002-03-01  0.440661 -0.323184 -0.372120 -1.754519
2002-03-07 -0.358349  0.796041 -0.308464 -0.431374
2002-03-02  0.460905 -0.793540  0.076552  0.228480
2002-03-03  0.644773  1.488210  0.109205  0.324083
2002-03-06 -1.702933 -1.097423  0.362248  0.615953
2002-03-10  0.253730  0.097930  2.355097 -1.083530

In [45]:
df.sort_values(by='D')
# sort by D

                   A         B         C         D
2002-03-01  0.440661 -0.323184 -0.372120 -1.754519
2002-03-08 -2.273382  0.734601 -0.507984 -1.332302
2002-03-10  0.253730  0.097930  2.355097 -1.083530
2002-03-07 -0.358349  0.796041 -0.308464 -0.431374
2002-03-09  0.068889 -0.642809 -1.871480 -0.191310
2002-03-02  0.460905 -0.793540  0.076552  0.228480
2002-03-05  0.731510 -1.437294 -1.028375  0.304454
2002-03-03  0.644773  1.488210  0.109205  0.324083
2002-03-06 -1.702933 -1.097423  0.362248  0.615953
2002-03-04 -0.926943 -0.314424 -1.191608  0.737745

# how to select data form data frome

In [47]:
df['C']
# c column from data frame

2002-03-01   -0.372120
2002-03-02    0.076552
2002-03-03    0.109205
2002-03-04   -1.191608
2002-03-05   -1.028375
2002-03-06    0.362248
2002-03-07   -0.308464
2002-03-08   -0.507984
2002-03-09   -1.871480
2002-03-10    2.355097
Freq: D, Name: C, dtype: float64

In [49]:
df[0:3]
# access the row  from 0 to 2 row from data

                   A         B         C         D
2002-03-01  0.440661 -0.323184 -0.372120 -1.754519
2002-03-02  0.460905 -0.793540  0.076552  0.228480
2002-03-03  0.644773  1.488210  0.109205  0.324083

In [51]:
df['C'][0:3]
# acces only row data from data frame

2002-03-01   -0.372120
2002-03-02    0.076552
2002-03-03    0.109205
Freq: D, Name: C, dtype: float64

In [52]:
# pass value by lable 
df.loc[d[0]] 
# label Where we declare

A    0.440661
B   -0.323184
C   -0.372120
D   -1.754519
Name: 2002-03-01 00:00:00, dtype: float64

In [53]:
# Multiaccess by lable 
df.loc[:,['A','C']]

                   A         C
2002-03-01  0.440661 -0.372120
2002-03-02  0.460905  0.076552
2002-03-03  0.644773  0.109205
2002-03-04 -0.926943 -1.191608
2002-03-05  0.731510 -1.028375
2002-03-06 -1.702933  0.362248
2002-03-07 -0.358349 -0.308464
2002-03-08 -2.273382 -0.507984
2002-03-09  0.068889 -1.871480
2002-03-10  0.253730  2.355097

In [55]:
df.loc['20020306':'20020310',['C','D']]
# access label form index frame

                   C         D
2002-03-06  0.362248  0.615953
2002-03-07 -0.308464 -0.431374
2002-03-08 -0.507984 -1.332302
2002-03-09 -1.871480 -0.191310
2002-03-10  2.355097 -1.083530

In [57]:
df.loc['20020306',['C','D']]
#for only one value we can just pass only one value

C    0.362248
D    0.615953
Name: 2002-03-06 00:00:00, dtype: float64

In [58]:
df.at[d[0],'C']

-0.3721200601631624

In [60]:
df[df['A']>0]
# it return only value which is greater than the 0

                   A         B         C         D
2002-03-01  0.440661 -0.323184 -0.372120 -1.754519
2002-03-02  0.460905 -0.793540  0.076552  0.228480
2002-03-03  0.644773  1.488210  0.109205  0.324083
2002-03-05  0.731510 -1.437294 -1.028375  0.304454
2002-03-09  0.068889 -0.642809 -1.871480 -0.191310
2002-03-10  0.253730  0.097930  2.355097 -1.083530

In [62]:
df[df['A']<0]
# it return all-ve value

                   A         B         C         D
2002-03-04 -0.926943 -0.314424 -1.191608  0.737745
2002-03-06 -1.702933 -1.097423  0.362248  0.615953
2002-03-07 -0.358349  0.796041 -0.308464 -0.431374
2002-03-08 -2.273382  0.734601 -0.507984 -1.332302

In [63]:
df[df['A']>2]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [ ]:
# method